The TTD platform provides a unified data injection interface for OpenTelemetry metrics and traces generated by Ambrosia/TRON and SPRING Boot applications. Metrics data is stored in S3 using Cortex, while trace data is captured via Grafana TEMPO and also stored in S3. The retention period is 7 days for traces and 30 days for metrics. TTD offers a telemetry API for non-Ambrosia applications to export trace data without relying on the OpenTelemetry SDK. This API collects trace data from the client's service with minimal latency, exports it to the TTD platform, and converts it to the OpenTelemetry-specific format before publishing it to Grafana Tempo.



The TTD platform provides a centralized data injection interface for OpenTelemetry metrics and traces generated by DDD, FF, and SPRING Boot applications. Metrics data is stored in S3 via Cortex, while trace data is captured via Grafana TEMPO and also stored in S3. The retention periods are 7 days for traces and 30 days for metrics. TTD exposes endpoints for clients to export data from their services to the platform. Additionally, TTD offers a telemetry API for non-Ambrosia applications to export trace data without relying on the OpenTelemetry SDK. This API collects trace data from the client's service with minimal latency, exports it to the TTD platform, converts it to the OpenTelemetry-specific format, and then publishes it to Grafana Tempo.


Good morning. I hope this message finds you well. This is Jan from EQ CASH MO Organization, reporting to UU Brady, previously with PP Kumar.

Recently, I had a discussion with EE Warden regarding my next career move, which I would like to align more with the Technology and Engineering sectors. He suggested that I reach out to you, as he believes there may be upcoming opportunities in the TTS space.

If it is convenient for you, could we schedule a 15-minute call tomorrow or at another available time this week?

Thank you for your time and consideration.


Good morning. This is Jan from EQ CASH MO Organization, reporting to UU Brady and leading the Low-Latency & Cloud Engineering space. I previously worked with PP Kumar.

Recently, I discussed my next career move with EE Warden, expressing my desire to focus more on Technology and Engineering. He recommended that I speak with you, as he believes there may be an appropriate technology role opening in the TTS space.

If it is convenient for you, could we schedule a 15-minute call tomorrow or at another available time this week?

This is Jan from EQ CASH MO Organization, reporting to UU Brady and leading the Low Latency & Cloud Engineering space. I previously worked with PP Kumar on the IDF delivery project. Recently, I discussed my next career move with EE Warden, expressing my desire to align more with Technology and Engineering. He suggested I speak with you, as he believes there may be upcoming opportunities in the TTS space that suit my experience and skills well. If convenient, could we schedule a 15-minute call tomorrow or another available time this week?
