
DFR acts as an OpenTelemetry translator positioned between the FXC microservices and TEMPO. This service aims to shield the client microservice from the overhead of the OpenTelemetry dependency and to reduce the volume of data exported from the source.


The XDC Trace Collector is an interface for Grafana Tempo that provides HTTP/GRPC endpoints to receive OpenTelemetry trace data. It stores this data in an S3 bucket with a retention period of seven days. Application teams can use this centralized platform to publish their telemetry data and visualize it using TRON-GRAFANA.

A new self-service configuration screen has been added to the FDC Dashboard, allowing application teams to manage their notification settings, such as email distribution lists and enabling or disabling notifications.

he DJH Grafana Dashboard has been expanded to onboard new departments and application teams by adding a new organization within the Grafana setup. This addition provides teams with a dedicated space and allows them to manage their entitlements independently. The JHD team is also working on integrating LDPA authentication into the dashboard to enhance access management.




I hope this message finds you well. I am writing to request your assistance in raising a job requisition to backfill Ken's position, as he has resigned and will be leaving the firm by the end of August 2024.

From the Engineering and Architecture Team's perspective, it is crucial to fill this position promptly. The team is expanding our telemetry and visualization platform to support multiple applications across the FFD Cash organization. Ken was the sole resource managing the UX development for the GFF platform, and his departure will significantly impact our ability to deliver on multiple critical tasks related to telemetry and FFG.

Given the team's already lean structure, an immediate backfill is essential to maintain our project timelines and deliverables.

Thank you for your prompt attention to this matter.


I hope this message finds you well. I am writing to request your assistance in raising a job requisition to backfill Ken's position. Ken has resigned and will be leaving the firm by the end of August 2024.

From the Engineering and Architecture Team's perspective, it is crucial to fill this position as soon as possible. The team is currently working on extending our telemetry and visualization platform to support multiple applications across the FFD Cash organization. Ken's role was pivotal in managing the UX development of the GFF platform, and his departure leaves a significant gap.

Our team is already lean, and without this position filled immediately, we will struggle to deliver several critical tasks related to telemetry and FFG projects. Your prompt action on this matter will greatly help us maintain our project timelines and deliverables.


From the Engineering and Architecture Team's perspective, it is crucial to fill this position as soon as possible. Our team is currently extending the telemetry and visualization platform to support multiple applications across the FFD Cash organization, which is expected to generate a significant workload. Given that our team is already lean, this will impact our delivery timelines.

Additionally, Ken was solely responsible for managing the UX development of the GFF platform. Without an immediate replacement, we will struggle to deliver several critical tasks associated with the telemetry and FFG projects.


I hope this email finds you well. I am writing to request your assistance in raising a job requisition to backfill Ken's position. Ken has resigned and will be leaving the firm by the end of August 2024.

From the Engineering and Architecture Team's perspective, it is critical to fill this position as soon as possible. Our team is extending the telemetry and visualization platform to support multiple applications across the FFD Cash organization, which will significantly increase our workload. Given that our team is already lean, this will impact our delivery timelines.

Additionally, Ken was solely responsible for managing the UX development of the GFF platform. Without an immediate replacement, we will struggle to deliver several critical tasks associated with the telemetry and FFG projects. Considering the scope of work and the proficiency required, we would like to fill this position with a VP role based in the Canada location.

Your prompt action on this matter will be greatly appreciated.
